TDMTestUnzipped/Documents/Requests/CheckPhoneNumber_PhoneVerifySo_04_12_2019_15_40_03_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:que="http://ws.cdyne.com/PhoneVerify/query">
  <soapenv:Header />
  <soapenv:Body>
    <que:CheckPhoneNumber>
      <!--Optional:-->
      <que:PhoneNumber>7575449510</que:PhoneNumber>
      <!--Optional:-->
      <que:LicenseKey></que:LicenseKey>
    </que:CheckPhoneNumber>
  </soapenv:Body>
</soapenv:Envelope>